---
kind: property
id: P:Autodesk.Revit.DB.ParameterTypeId.RbsCurveSurfaceArea
source: html/f8aeb000-25cf-c097-c6ac-ae0000c4467a.htm
---
# Autodesk.Revit.DB.ParameterTypeId.RbsCurveSurfaceArea Property

"Area"

## Syntax (C#)
```csharp
public static ForgeTypeId RbsCurveSurfaceArea { get; }
```